Revit 2026 API

# FieldValues(IListValueAtPoint, XYZ) Constructor

---

Initializes a new instance of the FieldValues class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldValues(
	IList<ValueAtPoint> valueAtPoint,
	XYZ unitDirection
)
```
```vb
Public Sub New (
	valueAtPoint As IList(Of ValueAtPoint),
	unitDirection As XYZ
)
```
```cpp
public:
FieldValues(
	IList<ValueAtPoint^>^ valueAtPoint,
	XYZ^ unitDirection
)
```
```fsharp
new :
        valueAtPoint : IList<ValueAtPoint> *
        unitDirection : XYZ -> FieldValues
```

#### Parameters

valueAtPoint IListValueAtPoint

unitDirection XYZ

#### Reference

FieldValues Class

FieldValues Overload

Autodesk.Revit.DB.Analysis Namespace